app/controllers/employees_controller.rb

  def update
    employee = Employee.find(params[:id])
    employee.update(employee_params)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "employees" SET "updated_at" = $1, "employee_num" = $2, "employee_private_num" = $3 WHERE "employees"."id" = $4  [["updated_at", "2023-01-30 22:21:42.012316"], ["employee_num", 1], ["employee_private_num", 10], ["id", 3]]

  def create
    employee = Employee.new(employee_params)
    employee.save
---
INSERT INTO "employees" ("email", "name", "position", "employee_num", "employee_private_num", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["email", "1"], ["name", "1"], ["position", "1"], ["employee_num", "1"], ["employee_private_num", "1"], ["created_at", "2023-01-31 22:41:47.117374"], ["updated_at", "2023-01-31 22:41:47.117374"]]

  def destroy
    employee = Employee.find(params[:id])
    employee.destroy
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 1]]