app/controllers/front_view_controller.rb

  def create
    @employee = Employee.find_by(employee_params)
    unless @employee.nil?
      @check = @employee.front_views.new(check_params)
      @check.save ? flash[:notice] = 'Successfully check' : flash[:alert] = 'Checking faill'
---
INSERT INTO "front_views" ("check", "employee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["check", nil], ["employee_id", 3], ["created_at", "2023-01-30 22:23:21.173493"], ["updated_at", "2023-01-30 22:23:21.173493"]]