app/controllers/reports_controller.rb

SELECT "front_views".* FROM "front_views"
SELECT "employees".* FROM "employees"
---
  def generate_report
    @front_views = FrontView.all
    @employees = Employee.all