app/controllers/stores_controller.rb

  def show
    @store = Store.find(params[:id])
---
SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @store = Store.find(params[:id])
---
SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    store = Store.new(store_params)
    store.save
---
INSERT INTO "stores" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "1"], ["address", "1"], ["created_at", "2023-01-31 22:44:43.577957"], ["updated_at", "2023-01-31 22:44:43.577957"]]

  def destroy
    store = Store.find(params[:id])
    store.destroy
---
SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "stores" WHERE "stores"."id" = $1  [["id", 1]]