app/models/user.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---


        u = User.new(:email => "admin@example.com", :password => 'password', :password_confirmation => 'password')
        u.save