app/views/reports/generate_report.html.erb

SELECT "front_views".* FROM "front_views"
SELECT COUNT(*) AS "count_all", "front_views"."check" AS "front_views_check", DATE_TRUNC('second', "front_views"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC') AT TIME ZONE 'Etc/UTC' AS "date_trunc_second_front_views_created_at_timestamptz_at_time_zo" FROM "front_views" WHERE ("front_views"."created_at" IS NOT NULL) GROUP BY "front_views"."check", DATE_TRUNC('second', "front_views"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC') AT TIME ZONE 'Etc/UTC'
---
        <h3>Attendance by day:</h3>
        <%= line_chart FrontView.group(:check).group_by_day(:created_at).count %>

SELECT COUNT(*) AS "count_all", "front_views"."check" AS "front_views_check", DATE_TRUNC('day', "front_views"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date AS "date_trunc_day_front_views_created_at_timestamptz_at_time_zone_" FROM "front_views" WHERE ("front_views"."created_at" IS NOT NULL) GROUP BY "front_views"."check", DATE_TRUNC('day', "front_views"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date
---
            <h3>checkin :</h3>
            <%= bar_chart FrontView.where(check: 'in').group_by_month(:created_at, format: "%Y-%B").count %>

SELECT COUNT(*) AS "count_all", DATE_TRUNC('month', "front_views"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date AS "date_trunc_month_front_views_created_at_timestamptz_at_time_zon" FROM "front_views" WHERE "front_views"."check" = $1 AND ("front_views"."created_at" IS NOT NULL) GROUP BY DATE_TRUNC('month', "front_views"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date  [["check", "off"]]
---
            <h3>check off:</h3>
            <%= bar_chart FrontView.where(check: 'off').group_by_month(:created_at, format: "%Y-%B").count %>

SELECT COUNT(*) AS "count_all", "front_views"."created_at" AS "front_views_created_at", DATE_TRUNC('hour', "front_views"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC') AT TIME ZONE 'Etc/UTC' AS "date_trunc_hour_front_views_created_at_timestamptz_at_time_zone" FROM "front_views" WHERE ("front_views"."created_at" IS NOT NULL) GROUP BY "front_views"."created_at", DATE_TRUNC('hour', "front_views"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC') AT TIME ZONE 'Etc/UTC'
---
        <% @employees.each do |employee|  %>
            <% result = (employee.front_views.group_by_day(:created_at, range: employee.front_views.maximum(:created_at)..Time.now).count)%>